"TITLE" = "Fetch New Data";
"ENABLE_PUSH" = "Push";

"ENABLE_PUSH_TEXT_IPHONE" = "New data will be pushed to your iPhone from the server.";
"ENABLE_PUSH_TEXT_IPOD" = "New data will be pushed to your iPod from the server.";
"ENABLE_PUSH_TEXT_IPAD" = "New data will be pushed to your iPad from the server.";
"ENABLE_PUSH_TEXT_IPHONE_SIMULATOR" = "New data will be pushed to your\niPhone Simulator from the server.";

"WHEN_NOT_PUSHING" = "Fetch";
"WHEN_NOT_PUSHING_TEXT" = "The schedule below is used when push is off or for applications that do not support push. For better battery life, fetch less frequently.";

"15_MINUTES" = "Every 15 Minutes";
"30_MINUTES" = "Every 30 Minutes";
"60_MINUTES" = "Hourly";
"MANUALLY" = "Manually";

"ADVANCED" = "Advanced";

"SELECT_SCHEDULE" = "Select Schedule";

"PUSH" = "Push";
"FETCH" = "Fetch";
"MANUAL" = "Manual";

"WHEN_PUSH_NOT_AVAILABLE" = "If Push is not available, the Fetch schedule will be used.";
"WHEN_FETCH_NOT_AVAILABLE" = "If Manual is selected, this account will only check for updates when the application is in use.";
